Revit 2027 API
StructuralBehavior Enumeration
 Specifies whether structural elements behave orthotropically, isotropically, or transverse-isotropically.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StructuralBehavior
Public Enumeration StructuralBehavior
public enum class StructuralBehavior
type StructuralBehavior
Members
Member name | Value | Description
Isotropic | 0 |  The structural element behaves isotropically.
Orthotropic | 1 |  The structural element behaves orthotropically.
TransverseIsotropic | 2 |  The structural element behaves transverse-isotropically.
See Also
Reference
Autodesk.Revit.DB Namespace